thomas-pegot/esp32-camera/conversions/jpgd.c
	while (ndata) {	/* Process all tables in the segment */
		if (ndata < 65) return JDR_FMT1;	/* Err: table size is unaligned */
		ndata -= 65;
		d = *data++;							/* Get table property */
		if (d & 0xF0) return JDR_FMT1;			/* Err: not 8-bit resolution */
		i = d & 3;								/* Get table ID */
		pb = alloc_pool(jd, 64 * sizeof (int32_t));/* Allocate a memory block for the table */
		if (!pb) return JDR_MEM1;				/* Err: not enough memory */
		jd->qttbl[i] = pb;						/* Register the table */
		for (i = 0; i < 64; i++) {				/* Load the table */
			zi = Zig[i];						/* Zigzag-order to raster-order conversion */
			pb[zi] = (int32_t)((uint32_t)*data++ * Ipsf[zi]);	/* Apply scale factor of Arai algorithm to the de-quantizers */
		}
	}

	return JDR_OK;
}




/*-----------------------------------------------------------------------*/
/* Create huffman code tables with a DHT segment                         */
/*-----------------------------------------------------------------------*/

static JRESULT create_huffman_tbl (	/* 0:OK, !0:Failed */
	JDEC* jd,					/* Pointer to the decompressor object */
	const uint8_t* data,		/* Pointer to the packed huffman tables */
	size_t ndata				/* Size of input data */
)
{
	unsigned int i, j, b, cls, num;
	size_t np;
	uint8_t d, *pb, *pd;
	uint16_t hc, *ph;


	while (ndata) {	/* Process all tables in the segment */
		if (ndata < 17) return JDR_FMT1;	/* Err: wrong data size */
		ndata -= 17;
		d = *data++;						/* Get table number and class */
		if (d & 0xEE) return JDR_FMT1;		/* Err: invalid class/number */
		cls = d >> 4; num = d & 0x0F;		/* class = dc(0)/ac(1), table number = 0/1 */
		pb = alloc_pool(jd, 16);			/* Allocate a memory block for the bit distribution table */
		if (!pb) return JDR_MEM1;			/* Err: not enough memory */
		jd->huffbits[num][cls] = pb;
		for (np = i = 0; i < 16; i++) {		/* Load number of patterns for 1 to 16-bit code */
			np += (pb[i] = *data++);		/* Get sum of code words for each code */
		}
		ph = alloc_pool(jd, np * sizeof (uint16_t));/* Allocate a memory block for the code word table */
		jd->huffcode_len[num][cls] = np;
		if (!ph) return JDR_MEM1;			/* Err: not enough memory */
		jd->huffcode[num][cls] = ph;
		hc = 0;
		for (j = i = 0; i < 16; i++) {		/* Re-build huffman code word table */
			b = pb[i];
			while (b--) ph[j++] = hc++;
			hc <<= 1;
		}

		if (ndata < np) return JDR_FMT1;	/* Err: wrong data size */
		ndata -= np;
		pd = alloc_pool(jd, np);			/* Allocate a memory block for the decoded data */
		if (!pd) return JDR_MEM1;			/* Err: not enough memory */
		jd->huffdata[num][cls] = pd;
		for (i = 0; i < np; i++) {			/* Load decoded data corresponds to each code word */
			d = *data++;
			if (!cls && d > 11) return JDR_FMT1;
			pd[i] = d;
		}
#if JD_FASTDECODE == 2
		{	/* Create fast huffman decode table */
			unsigned int span, td, ti;
			uint16_t *tbl_ac = 0;
			uint8_t *tbl_dc = 0;

			if (cls) {
				tbl_ac = alloc_pool(jd, HUFF_LEN * sizeof (uint16_t));	/* LUT for AC elements */
				if (!tbl_ac) return JDR_MEM1;		/* Err: not enough memory */
				jd->hufflut_ac[num] = tbl_ac;
				memset(tbl_ac, 0xFF, HUFF_LEN * sizeof (uint16_t));		/* Default value (0xFFFF: may be long code) */
			} else {
				tbl_dc = alloc_pool(jd, HUFF_LEN * sizeof (uint8_t));	/* LUT for AC elements */
				if (!tbl_dc) return JDR_MEM1;		/* Err: not enough memory */
				jd->hufflut_dc[num] = tbl_dc;
				memset(tbl_dc, 0xFF, HUFF_LEN * sizeof (uint8_t));		/* Default value (0xFF: may be long code) */
			}
			for (i = b = 0; b < HUFF_BIT; b++) {	/* Create LUT */
				for (j = pb[b]; j; j--) {
					ti = ph[i] << (HUFF_BIT - 1 - b) & HUFF_MASK;	/* Index of input pattern for the code */
					if (cls) {
						td = pd[i++] | ((b + 1) << 8);	/* b15..b8: code length, b7..b0: zero run and data length */
						for (span = 1 << (HUFF_BIT - 1 - b); span; span--, tbl_ac[ti++] = (uint16_t)td) ;
					} else {
						td = pd[i++] | ((b + 1) << 4);	/* b7..b4: code length, b3..b0: data length */
						for (span = 1 << (HUFF_BIT - 1 - b); span; span--, tbl_dc[ti++] = (uint8_t)td) ;
					}
				}
			}
			jd->longofs[num][cls] = i;	/* Code table offset for long code */
		}
#endif
	}

	return JDR_OK;
}



/*-----------------------------------------------------------------------*/
/* Extract a huffman decoded data from input stream                      */
/*-----------------------------------------------------------------------*/

static int huffext (	/* >=0: decoded data, <0: error code */
	JDEC* jd,			/* Pointer to the decompressor object */
	unsigned int id,	/* Table ID (0:Y, 1:C) */
	unsigned int cls	/* Table class (0:DC, 1:AC) */
)
{
	size_t dc = jd->dctr;
	uint8_t *dp = jd->dptr;
	unsigned int d, flg = 0;

#if JD_FASTDECODE == 0
	uint8_t bm, nd, bl;
	const uint8_t *hb = jd->huffbits[id][cls];	/* Bit distribution table */
	const uint16_t *hc = jd->huffcode[id][cls];	/* Code word table */
	const uint8_t *hd = jd->huffdata[id][cls];	/* Data table */

	if (!hb || !hc || !hd || !jd->dptr || !jd->inbuf)
		return 0 - (int)JDR_FMT1;	/* Err: null data check */

	const uint16_t hc_len = jd->huffcode_len[id][0];
	const uint16_t* hc_last = hc + hc_len - 1;

	bm = jd->dbit;	/* Bit mask to extract */
	d = 0; bl = 16;	/* Max code length */
	do {
		if (!bm) {		/* Next byte? */
			if (!dc) {	/* No input data is available, re-fill input buffer */
				dp = jd->inbuf;	/* Top of input buffer */
				dc = jd->infunc(jd, dp, JD_SZBUF);
				if (!dc) return 0 - (int)JDR_INP;	/* Err: read error or wrong stream termination */
			} else {
				dp++;	/* Next data ptr */
			}
			dc--;		/* Decrement number of available bytes */
			if (flg) {		/* In flag sequence? */
				flg = 0;	/* Exit flag sequence */
				if (*dp != 0) return 0 - (int)JDR_FMT1;	/* Err: unexpected flag is detected (may be collapted data) */
				*dp = 0xFF;				/* The flag is a data 0xFF */
			} else {
				if (*dp == 0xFF) {		/* Is start of flag sequence? */
					flg = 1; continue;	/* Enter flag sequence, get trailing byte */
				}
			}
			bm = 0x80;		/* Read from MSB */
		}
		d <<= 1;			/* Get a bit */
		if (*dp & bm) d++;
		bm >>= 1;

		for (nd = *hb++; nd; nd--) {	/* Search the code word in this bit length */
			if (hc > hc_last)
				return 0 - (int)JDR_FMT1;	/* Err: Buffer overrun */
			if (d == *hc++) {	/* Matched? */
				jd->dbit = bm; jd->dctr = dc; jd->dptr = dp;
				return *hd;		/* Return the decoded data */
			}
			hd++;
		}
		bl--;
	} while (bl);

#else
	const uint8_t *hb, *hd;
	const uint16_t *hc;
	unsigned int nc, bl, wbit = jd->dbit % 32;
	uint32_t w = jd->wreg & ((1UL << wbit) - 1);


	while (wbit < 16) {	/* Prepare 16 bits into the working register */
		if (jd->marker) {
			d = 0xFF;	/* Input stream has stalled for a marker. Generate stuff bits */
		} else {
			if (!dc) {	/* Buffer empty, re-fill input buffer */
				dp = jd->inbuf;						/* Top of input buffer */
				dc = jd->infunc(jd, dp, JD_SZBUF);
				if (!dc) return 0 - (int)JDR_INP;	/* Err: read error or wrong stream termination */
			}
			d = *dp++; dc--;
			if (flg) {		/* In flag sequence? */
				flg = 0;	/* Exit flag sequence */
				if (d != 0) jd->marker = d;	/* Not an escape of 0xFF but a marker */
				d = 0xFF;
			} else {
				if (d == 0xFF) {		/* Is start of flag sequence? */
					flg = 1; continue;	/* Enter flag sequence, get trailing byte */
				}
			}
		}
		w = w << 8 | d;	/* Shift 8 bits in the working register */
		wbit += 8;
	}
	jd->dctr = dc; jd->dptr = dp;
	jd->wreg = w;

#if JD_FASTDECODE == 2
	/* Table serch for the short codes */
	d = (unsigned int)(w >> (wbit - HUFF_BIT));	/* Short code as table index */
	if (cls) {	/* AC element */
		d = jd->hufflut_ac[id][d];	/* Table decode */
		if (d != 0xFFFF) {	/* It is done if hit in short code */
			jd->dbit = wbit - (d >> 8);	/* Snip the code length */
			return d & 0xFF;	/* b7..0: zero run and following data bits */
		}
	} else {	/* DC element */
		d = jd->hufflut_dc[id][d];	/* Table decode */
		if (d != 0xFF) {	/* It is done if hit in short code */
			jd->dbit = wbit - (d >> 4);	/* Snip the code length  */
			return d & 0xF;	/* b3..0: following data bits */
		}
	}

