thomas-pegot/esp32-camera/conversions/jpgd.c
	/* Incremental serch for the codes longer than HUFF_BIT */
	hb = jd->huffbits[id][cls] + HUFF_BIT;				/* Bit distribution table */
	hc = jd->huffcode[id][cls] + jd->longofs[id][cls];	/* Code word table */
	hd = jd->huffdata[id][cls] + jd->longofs[id][cls];	/* Data table */
	bl = HUFF_BIT + 1;
#else
	/* Incremental serch for all codes */
	hb = jd->huffbits[id][cls];	/* Bit distribution table */
	hc = jd->huffcode[id][cls];	/* Code word table */
	hd = jd->huffdata[id][cls];	/* Data table */
	bl = 1;
#endif
	for ( ; bl <= 16; bl++) {	/* Incremental search */
		nc = *hb++;
		if (nc) {
			d = w >> (wbit - bl);
			do {	/* Search the code word in this bit length */
				if (d == *hc++) {		/* Matched? */
					jd->dbit = wbit - bl;	/* Snip the huffman code */
					return *hd;			/* Return the decoded data */
				}
				hd++;
			} while (--nc);
		}
	}
#endif

	return 0 - (int)JDR_FMT1;	/* Err: code not found (may be collapted data) */
}




/*-----------------------------------------------------------------------*/
/* Extract N bits from input stream                                      */
/*-----------------------------------------------------------------------*/

static int bitext (	/* >=0: extracted data, <0: error code */
	JDEC* jd,			/* Pointer to the decompressor object */
	unsigned int nbit	/* Number of bits to extract (1 to 16) */
)
{
	size_t dc = jd->dctr;
	uint8_t *dp = jd->dptr;
	unsigned int d, flg = 0;

	if (!dp)
		return 0 - (int)JDR_FMT1;	/* Err: incorrect format. */
		
#if JD_FASTDECODE == 0
	uint8_t mbit = jd->dbit;

	d = 0;
	do {
		if (!mbit) {			/* Next byte? */
			if (!dc) {			/* No input data is available, re-fill input buffer */
				dp = jd->inbuf;	/* Top of input buffer */
				dc = jd->infunc(jd, dp, JD_SZBUF);
				if (!dc) return 0 - (int)JDR_INP;	/* Err: read error or wrong stream termination */
			} else {
				dp++;			/* Next data ptr */
			}
			dc--;				/* Decrement number of available bytes */
			if (flg) {			/* In flag sequence? */
				flg = 0;		/* Exit flag sequence */
				if (*dp != 0) return 0 - (int)JDR_FMT1;	/* Err: unexpected flag is detected (may be collapted data) */
				*dp = 0xFF;		/* The flag is a data 0xFF */
			} else {
				if (*dp == 0xFF) {		/* Is start of flag sequence? */
					flg = 1; continue;	/* Enter flag sequence */
				}
			}
			mbit = 0x80;		/* Read from MSB */
		}
		d <<= 1;	/* Get a bit */
		if (*dp & mbit) d |= 1;
		mbit >>= 1;
		nbit--;
	} while (nbit);

	jd->dbit = mbit; jd->dctr = dc; jd->dptr = dp;
	return (int)d;

#else
	unsigned int wbit = jd->dbit % 32;
	uint32_t w = jd->wreg & ((1UL << wbit) - 1);


	while (wbit < nbit) {	/* Prepare nbit bits into the working register */
		if (jd->marker) {
			d = 0xFF;	/* Input stream stalled, generate stuff bits */
		} else {
			if (!dc) {	/* Buffer empty, re-fill input buffer */
				dp = jd->inbuf;	/* Top of input buffer */
				dc = jd->infunc(jd, dp, JD_SZBUF);
				if (!dc) return 0 - (int)JDR_INP;	/* Err: read error or wrong stream termination */
			}
			d = *dp++; dc--;
			if (flg) {		/* In flag sequence? */
				flg = 0;	/* Exit flag sequence */
				if (d != 0) jd->marker = d;	/* Not an escape of 0xFF but a marker */
				d = 0xFF;
			} else {
				if (d == 0xFF) {		/* Is start of flag sequence? */
					flg = 1; continue;	/* Enter flag sequence, get trailing byte */
				}
			}
		}
		w = w << 8 | d;	/* Get 8 bits into the working register */
		wbit += 8;
	}
	jd->wreg = w; jd->dbit = wbit - nbit;
	jd->dctr = dc; jd->dptr = dp;

	return (int)(w >> ((wbit - nbit) % 32));
#endif
}




/*-----------------------------------------------------------------------*/
/* Process restart interval                                              */
/*-----------------------------------------------------------------------*/

static JRESULT restart (
	JDEC* jd,		/* Pointer to the decompressor object */
	uint16_t rstn	/* Expected restert sequense number */
)
{
	unsigned int i;
	uint8_t *dp = jd->dptr;
	size_t dc = jd->dctr;

#if JD_FASTDECODE == 0
	uint16_t d = 0;

	/* Get two bytes from the input stream */
	for (i = 0; i < 2; i++) {
		if (!dc) {	/* No input data is available, re-fill input buffer */
			dp = jd->inbuf;
			dc = jd->infunc(jd, dp, JD_SZBUF);
			if (!dc) return JDR_INP;
		} else {
			dp++;
		}
		dc--;
		d = d << 8 | *dp;	/* Get a byte */
	}
	jd->dptr = dp; jd->dctr = dc; jd->dbit = 0;

	/* Check the marker */
	if ((d & 0xFFD8) != 0xFFD0 || (d & 7) != (rstn & 7)) {
		return JDR_FMT1;	/* Err: expected RSTn marker is not detected (may be collapted data) */
	}

#else
	uint16_t marker;


	if (jd->marker) {	/* Generate a maker if it has been detected */
		marker = 0xFF00 | jd->marker;
		jd->marker = 0;
	} else {
		marker = 0;
		for (i = 0; i < 2; i++) {	/* Get a restart marker */
			if (!dc) {		/* No input data is available, re-fill input buffer */
				dp = jd->inbuf;
				dc = jd->infunc(jd, dp, JD_SZBUF);
				if (!dc) return JDR_INP;
			}
			marker = (marker << 8) | *dp++;	/* Get a byte */
			dc--;
		}
		jd->dptr = dp; jd->dctr = dc;
	}

	/* Check the marker */
	if ((marker & 0xFFD8) != 0xFFD0 || (marker & 7) != (rstn & 7)) {
		return JDR_FMT1;	/* Err: expected RSTn marker was not detected (may be collapted data) */
	}

	jd->dbit = 0;			/* Discard stuff bits */
#endif

	jd->dcv[2] = jd->dcv[1] = jd->dcv[0] = 0;	/* Reset DC offset */
	return JDR_OK;
}

// sqrt_i32 computes the squrare root of a 32bit integer and returns
// a 32bit integer value. It requires that v is positive.
int32_t sqrt_i32(int32_t v) {
    uint32_t b = 1<<30, q = 0, r = v;
    while (b > r)
        b >>= 2;
    while( b > 0 ) {
        uint32_t t = q + b;
        q >>= 1;           
        if( r >= t ) {     
            r -= t;        
            q += b;        
        }
        b >>= 2;
    }
    return q;
}

/*-----------------------------------------------------------------------*/
/* Apply Inverse-DCT in Arai Algorithm (see also aa_idct.png)            */
/*-----------------------------------------------------------------------*/

static void block_idct (
	int32_t* src,	/* Input block data (de-quantized and pre-scaled for Arai Algorithm) */
	jd_yuv_t* dst	/* Pointer to the destination to store the block as byte array */
)
{
    //ESP_ERROR_CHECK( heap_trace_start(HEAP_TRACE_LEAKS) );
	const int32_t M13 = (int32_t)(1.41421*4096), M2 = (int32_t)(1.08239*4096), M4 = (int32_t)(2.61313*4096), M5 = (int32_t)(1.84776*4096);
	int32_t v0, v1, v2, v3, v4, v5, v6, v7;
	int32_t t10, t11, t12, t13;
	int i;
#if PHASE_DCT >= 2
	int8_t curr = 0;
	int8_t *p_bg = &bg.table[bg.i * bg.width + bg.j];

	v0 = src[8 * 0]; /* DC component*/
	if(!(cnt % bg.f_nb_update) || !cnt) { 
			*p_bg = (int8_t)((v0 > (int32_t)0) - (v0 < (int32_t)0)); /* capture background DCT sign */
	}else { 			
			curr = (int8_t)((v0 > (int32_t)0) - (v0 < (int32_t)0)); /* capture current image DCT sign */
			if(abs(*p_bg - curr)<1) { /* SAD bg - curr if not same then change detected else display black */
				memset(&dst[0], (int16_t)0, 64*sizeof(int16_t));
				return;			
			}
#if PHASE_DCT == 3
			else {
				memset(&dst[0], (int16_t)127, 64*sizeof(int16_t));
				return;	
			}
#endif
	} 
#endif
	/* Process columns */
	for (i = 0; i < 8; i++) {
		v0 = src[8 * 0];	/* Get even elements */
		v1 = src[8 * 2];
		v2 = src[8 * 4];
		v3 = src[8 * 6];

		v4 = src[8 * 7];	/* Get odd elements */
		v5 = src[8 * 1];
		v6 = src[8 * 5];
		v7 = src[8 * 3];
#if DCT_FILTER == 1
		/* DCT filter : Avg - 3.sigma < vi < Avg + 3.sigma */
		const int32_t avg = (v0+v1+v2+v3+v4+v5+v6+v7)>>3; // avg = sum / 8
		const int32_t three_std = sqrt_i32(pow((v0 - avg), 2) +pow((v1 - avg), 2) +pow((v2 - avg), 2) +\
			pow((v4 - avg), 2) +pow((v5 - avg), 2) +pow((v6 - avg), 2) +pow((v7 - avg), 2)) * 3;
		v0 = (abs(v0 - avg) < three_std) ? v0 : 0;
#endif
#if PHASE_DCT == 1
		dst[8 * 0] = (int8_t)((v0 > (int32_t)0) - (v0 < (int32_t)0));
		dst[8 * 2] = (int8_t)((v1 > (int32_t)0) - (v1 < (int32_t)0));
		dst[8 * 4] = (int8_t)((v2 > (int32_t)0) - (v2 < (int32_t)0));
		dst[8 * 6] = (int8_t)((v3 > (int32_t)0) - (v3 < (int32_t)0));
		dst[8 * 7] = (int8_t)((v4 > (int32_t)0) - (v4 < (int32_t)0));
		dst[8 * 1] = (int8_t)((v5 > (int32_t)0) - (v5 < (int32_t)0));
		dst[8 * 5] = (int8_t)((v6 > (int32_t)0) - (v6 < (int32_t)0));
		dst[8 * 3] = (int8_t)((v7 > (int32_t)0) - (v7 < (int32_t)0));
		dst++;
		return;
#endif
		t10 = v0 + v2;		/* Process the even elements */
		t12 = v0 - v2;
		t11 = (v1 - v3) * M13 >> 12;
		v3 += v1;
		t11 -= v3;
		v0 = t10 + v3;
		v3 = t10 - v3;
		v1 = t11 + t12;
		v2 = t12 - t11;

		t10 = v5 - v4;		/* Process the odd elements */
		t11 = v5 + v4;
		t12 = v6 - v7;
		v7 += v6;
		v5 = (t11 - v7) * M13 >> 12;
		v7 += t11;
		t13 = (t10 + t12) * M5 >> 12;
		v4 = t13 - (t10 * M2 >> 12);
		v6 = t13 - (t12 * M4 >> 12) - v7;
		v5 -= v6;
		v4 -= v5;


		src[8 * 0] = v0 + v7;	/* Write-back transformed values */
		src[8 * 7] = v0 - v7;
		src[8 * 1] = v1 + v6;
		src[8 * 6] = v1 - v6;
		src[8 * 2] = v2 + v5;
		src[8 * 5] = v2 - v5;
		src[8 * 3] = v3 + v4;
		src[8 * 4] = v3 - v4;

		src++;	/* Next column */
	}

	src -= 8;
#if PHASE_DCT == 1
	return;
#endif

