thomas-pegot/esp32-camera/conversions/jpgd.c
	/* Process rows */
	for (i = 0; i < 8; i++) {
		v0 = src[0] + (128L << 8);	/* Get even elements (remove DC offset (-128) here) */
		v1 = src[2];
		v2 = src[4];
		v3 = src[6];

		v4 = src[7];				/* Get odd elements */
		v5 = src[1];
		v6 = src[5];
		v7 = src[3];

		t10 = v0 + v2;				/* Process the even elements */
		t12 = v0 - v2;
		t11 = (v1 - v3) * M13 >> 12;
		v3 += v1;
		t11 -= v3;
		v0 = t10 + v3;
		v3 = t10 - v3;
		v1 = t11 + t12;
		v2 = t12 - t11;

		t10 = v5 - v4;				/* Process the odd elements */
		t11 = v5 + v4;
		t12 = v6 - v7;
		v7 += v6;
		v5 = (t11 - v7) * M13 >> 12;
		v7 += t11;
		t13 = (t10 + t12) * M5 >> 12;
		v4 = t13 - (t10 * M2 >> 12);
		v6 = t13 - (t12 * M4 >> 12) - v7;
		v5 -= v6;
		v4 -= v5;

		/* Descale the transformed values 8 bits and output a row */
#if JD_FASTDECODE >= 1
		dst[0] = (int16_t)((v0 + v7) >> 8);
		dst[7] = (int16_t)((v0 - v7) >> 8);
		dst[1] = (int16_t)((v1 + v6) >> 8);
		dst[6] = (int16_t)((v1 - v6) >> 8);
		dst[2] = (int16_t)((v2 + v5) >> 8);
		dst[5] = (int16_t)((v2 - v5) >> 8);
		dst[3] = (int16_t)((v3 + v4) >> 8);
		dst[4] = (int16_t)((v3 - v4) >> 8);
#else
		dst[0] = BYTECLIP((v0 + v7) >> 8);
		dst[7] = BYTECLIP((v0 - v7) >> 8);
		dst[1] = BYTECLIP((v1 + v6) >> 8);
		dst[6] = BYTECLIP((v1 - v6) >> 8);
		dst[2] = BYTECLIP((v2 + v5) >> 8);
		dst[5] = BYTECLIP((v2 - v5) >> 8);
		dst[3] = BYTECLIP((v3 + v4) >> 8);
		dst[4] = BYTECLIP((v3 - v4) >> 8);
#endif
		dst += 8; src += 8;	/* Next row */
	}
    //ESP_ERROR_CHECK( heap_trace_stop() );
    //heap_trace_dump();
}



/*-----------------------------------------------------------------------*/
/* Load all blocks in an MCU into working buffer                         */
/*-----------------------------------------------------------------------*/

static JRESULT mcu_load (
	JDEC* jd		/* Pointer to the decompressor object */

)
{
    //ESP_ERROR_CHECK( heap_trace_start(HEAP_TRACE_LEAKS) );
	int32_t *tmp = (int32_t*)jd->workbuf;	/* Block working buffer for de-quantize and IDCT */
	int d, e;
	unsigned int blk, nby, i, bc, z, id, cmp;
	jd_yuv_t *bp;
	const int32_t *dqf;

	if (!jd->workbuf)
		return JDR_FMT1;

	nby = jd->msx * jd->msy;	/* Number of Y blocks (1, 2 or 4) */
	bp = jd->mcubuf;			/* Pointer to the first block of MCU */

	for (blk = 0; blk < nby + 2; blk++) {	/* Get nby Y blocks and two C blocks */
		cmp = (blk < nby) ? 0 : blk - nby + 1;	/* Component number 0:Y, 1:Cb, 2:Cr */

		if (cmp && jd->ncomp != 3) {		/* Clear C blocks if not exist (monochrome image) */
			for (i = 0; i < 64; bp[i++] = 128) ;

		} else {							/* Load Y/C blocks from input stream */
			id = cmp ? 1 : 0;						/* Huffman table ID of this component */

			/* Extract a DC element from input stream */
			d = huffext(jd, id, 0);					/* Extract a huffman coded data (bit length) */
			if (d < 0) return (JRESULT)(0 - d);		/* Err: invalid code or input */
			bc = (unsigned int)d;
			d = jd->dcv[cmp];						/* DC value of previous block */
			if (bc) {								/* If there is any difference from previous block */
				e = bitext(jd, bc);					/* Extract data bits */
				if (e < 0) return (JRESULT)(0 - e);	/* Err: input */
				bc = 1 << (bc - 1);					/* MSB position */
				if (!(e & bc)) e -= (bc << 1) - 1;	/* Restore negative value if needed */
				d += e;								/* Get current value */
				jd->dcv[cmp] = (int16_t)d;			/* Save current DC value for next block */
			}
			dqf = jd->qttbl[jd->qtid[cmp]];			/* De-quantizer table ID for this component */
			tmp[0] = d * dqf[0] >> 8;				/* De-quantize, apply scale factor of Arai algorithm and descale 8 bits */

			/* Extract following 63 AC elements from input stream */
			memset(&tmp[1], 0, 63 * sizeof (int32_t));	/* Initialize all AC elements */
			z = 1;		/* Top of the AC elements (in zigzag-order) */
			do {
				d = huffext(jd, id, 1);				/* Extract a huffman coded value (zero runs and bit length) */
				if (d == 0) break;					/* EOB? */
				if (d < 0) return (JRESULT)(0 - d);	/* Err: invalid code or input error */
				bc = (unsigned int)d;
				z += bc >> 4;						/* Skip leading zero run */
				if (z >= 64) return JDR_FMT1;		/* Too long zero run */
				if (bc &= 0x0F) {					/* Bit length? */
					d = bitext(jd, bc);				/* Extract data bits */
					if (d < 0) return (JRESULT)(0 - d);	/* Err: input device */
					bc = 1 << (bc - 1);				/* MSB position */
					if (!(d & bc)) d -= (bc << 1) - 1;	/* Restore negative value if needed */
					i = Zig[z];						/* Get raster-order index */
					tmp[i] = d * dqf[i] >> 8;		/* De-quantize, apply scale factor of Arai algorithm and descale 8 bits */
				}
			} while (++z < 64);		/* Next AC element */

			if (JD_FORMAT != 2 || !cmp) {	/* C components may not be processed if in grayscale output */
#if AC_OPTIM
				if (z == 1 || (JD_USE_SCALE && jd->scale == 3)) {	// If no AC element or scale ratio is 1/8, IDCT can be ommited and the block is filled with DC value
					d = (jd_yuv_t)((*tmp / 256) + 128);
#if AC_OPTIM == 2
					d = 128;
#endif
					if (JD_FASTDECODE >= 1) {
						for (i = 0; i < 64; bp[i++] = d) ;
					} else {
						memset(bp, d, 64);
					}
				} else {
#endif
						block_idct(tmp, bp);	/* Apply IDCT and store the block to the MCU buffer */
#if AC_OPTIM
				}
#endif
			}
		}
		bp += 64;				/* Next block */
	}

	return JDR_OK;	/* All blocks have been loaded successfully */
	//ESP_ERROR_CHECK( heap_trace_stop() );
    //heap_trace_dump();
}




/*-----------------------------------------------------------------------*/
/* Output an MCU: Convert YCrCb to RGB and output it in RGB form         */
/*-----------------------------------------------------------------------*/

static JRESULT mcu_output (
	JDEC* jd,			/* Pointer to the decompressor object */
	int (*outfunc)(JDEC*, void*, JRECT*),	/* RGB output function */
	unsigned int x,		/* MCU location in the image */
	unsigned int y		/* MCU location in the image */
)
{
	const int CVACC = (sizeof (int) > 2) ? 1024 : 128;	/* Adaptive accuracy for both 16-/32-bit systems */
	unsigned int ix, iy, mx, my, rx, ry;
	int yy, cb, cr;
	jd_yuv_t *py, *pc;
	uint8_t *pix;
	JRECT rect;


