thomas-pegot/esp32-camera/conversions/jpgd.c
	mx = jd->msx * 8; my = jd->msy * 8;					/* MCU size (pixel) */
	rx = (x + mx <= jd->width) ? mx : jd->width - x;	/* Output rectangular size (it may be clipped at right/bottom end of image) */
	ry = (y + my <= jd->height) ? my : jd->height - y;
	if (JD_USE_SCALE) {
		rx >>= jd->scale; ry >>= jd->scale;
		if (!rx || !ry) return JDR_OK;					/* Skip this MCU if all pixel is to be rounded off */
		x >>= jd->scale; y >>= jd->scale;
	}
	rect.left = x; rect.right = x + rx - 1;				/* Rectangular area in the frame buffer */
	rect.top = y; rect.bottom = y + ry - 1;


	if (!JD_USE_SCALE || jd->scale != 3) {	/* Not for 1/8 scaling */
		pix = (uint8_t*)jd->workbuf;

		if (JD_FORMAT != 2) {	/* RGB output (build an RGB MCU from Y/C component) */
			for (iy = 0; iy < my; iy++) {
				pc = py = jd->mcubuf;
				if (my == 16) {		/* Double block height? */
					pc += 64 * 4 + (iy >> 1) * 8;
					if (iy >= 8) py += 64;
				} else {			/* Single block height */
					pc += mx * 8 + iy * 8;
				}
				py += iy * 8;
				for (ix = 0; ix < mx; ix++) {
					cb = pc[0] - 128; 	/* Get Cb/Cr component and remove offset */
					cr = pc[64] - 128;
					if (mx == 16) {					/* Double block width? */
						if (ix == 8) py += 64 - 8;	/* Jump to next block if double block heigt */
						pc += ix & 1;				/* Step forward chroma pointer every two pixels */
					} else {						/* Single block width */
						pc++;						/* Step forward chroma pointer every pixel */
					}
					yy = *py++;			/* Get Y component */
					*pix++ = /*R*/ BYTECLIP(yy + ((int)(1.402 * CVACC) * cr) / CVACC);
					*pix++ = /*G*/ BYTECLIP(yy - ((int)(0.344 * CVACC) * cb + (int)(0.714 * CVACC) * cr) / CVACC);
					*pix++ = /*B*/ BYTECLIP(yy + ((int)(1.772 * CVACC) * cb) / CVACC);
				}
			}
		} else {	/* Monochrome output (build a grayscale MCU from Y comopnent) */
			for (iy = 0; iy < my; iy++) {
				py = jd->mcubuf + iy * 8;
				if (my == 16) {		/* Double block height? */
					if (iy >= 8) py += 64;
				}
				for (ix = 0; ix < mx; ix++) {
					if (mx == 16) {					/* Double block width? */
						if (ix == 8) py += 64 - 8;	/* Jump to next block if double block height */
					}
					*pix++ = (uint8_t)*py++;			/* Get and store a Y value as grayscale */
				}
			}
		}

		/* Descale the MCU rectangular if needed */
		if (JD_USE_SCALE && jd->scale) {
			unsigned int x, y, r, g, b, s, w, a;
			uint8_t *op;

			/* Get averaged RGB value of each square correcponds to a pixel */
			s = jd->scale * 2;	/* Number of shifts for averaging */
			w = 1 << jd->scale;	/* Width of square */
			a = (mx - w) * (JD_FORMAT != 2 ? 3 : 1);	/* Bytes to skip for next line in the square */
			op = (uint8_t*)jd->workbuf;
			for (iy = 0; iy < my; iy += w) {
				for (ix = 0; ix < mx; ix += w) {
					pix = (uint8_t*)jd->workbuf + (iy * mx + ix) * (JD_FORMAT != 2 ? 3 : 1);
					r = g = b = 0;
					for (y = 0; y < w; y++) {	/* Accumulate RGB value in the square */
						for (x = 0; x < w; x++) {
							r += *pix++;	/* Accumulate R or Y (monochrome output) */
							if (JD_FORMAT != 2) {	/* RGB output? */
								g += *pix++;	/* Accumulate G */
								b += *pix++;	/* Accumulate B */
							}
						}
						pix += a;
					}							/* Put the averaged pixel value */
					*op++ = (uint8_t)(r >> s);	/* Put R or Y (monochrome output) */
					if (JD_FORMAT != 2) {	/* RGB output? */
						*op++ = (uint8_t)(g >> s);	/* Put G */
						*op++ = (uint8_t)(b >> s);	/* Put B */
					}
				}
			}
		}

	} else {	/* For only 1/8 scaling (left-top pixel in each block are the DC value of the block) */

		/* Build a 1/8 descaled RGB MCU from discrete comopnents */
		pix = (uint8_t*)jd->workbuf;
		pc = jd->mcubuf + mx * my;
		cb = pc[0] - 128;		/* Get Cb/Cr component and restore right level */
		cr = pc[64] - 128;
		for (iy = 0; iy < my; iy += 8) {
			py = jd->mcubuf;
			if (iy == 8) py += 64 * 2;
			for (ix = 0; ix < mx; ix += 8) {
				yy = *py;	/* Get Y component */
				py += 64;
				if (JD_FORMAT != 2) {
					*pix++ = /*R*/ BYTECLIP(yy + ((int)(1.402 * CVACC) * cr / CVACC));
					*pix++ = /*G*/ BYTECLIP(yy - ((int)(0.344 * CVACC) * cb + (int)(0.714 * CVACC) * cr) / CVACC);
					*pix++ = /*B*/ BYTECLIP(yy + ((int)(1.772 * CVACC) * cb / CVACC));
				} else {
					*pix++ = yy;
				}
			}
		}
	}

	/* Squeeze up pixel table if a part of MCU is to be truncated */
	mx >>= jd->scale;
	if (rx < mx) {	/* Is the MCU spans right edge? */
		uint8_t *s, *d;
		unsigned int x, y;

		s = d = (uint8_t*)jd->workbuf;
		for (y = 0; y < ry; y++) {
			for (x = 0; x < rx; x++) {	/* Copy effective pixels */
				*d++ = *s++;
				if (JD_FORMAT != 2) {
					*d++ = *s++;
					*d++ = *s++;
				}
			}
			s += (mx - rx) * (JD_FORMAT != 2 ? 3 : 1);	/* Skip truncated pixels */
		}
	}

	/* Convert RGB888 to RGB565 if needed */
	if (JD_FORMAT == 1) {
		uint8_t *s = (uint8_t*)jd->workbuf;
		uint16_t w, *d = (uint16_t*)s;
		unsigned int n = rx * ry;

		do {
			w = (*s++ & 0xF8) << 8;		/* RRRRR----------- */
			w |= (*s++ & 0xFC) << 3;	/* -----GGGGGG----- */
			w |= *s++ >> 3;				/* -----------BBBBB */
			*d++ = w;
		} while (--n);
	}

	/* Output the rectangular */
	return outfunc(jd, jd->workbuf, &rect) ? JDR_OK : JDR_INTR; 
}




/*-----------------------------------------------------------------------*/
/* Analyze the JPEG image and Initialize decompressor object             */
/*-----------------------------------------------------------------------*/

#define	LDB_WORD(ptr)		(uint16_t)(((uint16_t)*((uint8_t*)(ptr))<<8)|(uint16_t)*(uint8_t*)((ptr)+1))


JRESULT jd_prepare (
	JDEC* jd,				/* Blank decompressor object */
	unsigned int (*infunc)(JDEC*, uint8_t*, size_t),	/* JPEG strem input function */
	void* pool,				/* Working buffer for the decompression session */
	size_t sz_pool,			/* Size of working buffer */
	void* dev				/* I/O device identifier for the session */
)
{
	uint8_t *seg, b;
	uint16_t marker;
	unsigned int n, i, ofs;
	size_t len;
	JRESULT rc;


	memset(jd, 0, sizeof (JDEC));	/* Clear decompression object (this might be a problem if machine's null pointer is not all bits zero) */
	jd->pool = pool;		/* Work memroy */
	jd->sz_pool = sz_pool;	/* Size of given work memory */
	jd->infunc = infunc;	/* Stream input function */
	jd->device = dev;		/* I/O device identifier */

	jd->inbuf = seg = alloc_pool(jd, JD_SZBUF);		/* Allocate stream input buffer */
	if (!seg) return JDR_MEM1;

	ofs = marker = 0;		/* Find SOI marker */
	do {
		if (jd->infunc(jd, seg, 1) != 1) return JDR_INP;	/* Err: SOI was not detected */
		ofs++;
		marker = marker << 8 | seg[0];
	} while (marker != 0xFFD8);

	for (;;) {				/* Parse JPEG segments */
		/* Get a JPEG marker */
		if (jd->infunc(jd, seg, 4) != 4) return JDR_INP;
		marker = LDB_WORD(seg);		/* Marker */
		len = LDB_WORD(seg + 2);	/* Length field */
		if (len <= 2 || (marker >> 8) != 0xFF) return JDR_FMT1;
		len -= 2;			/* Segent content size */
		ofs += 4 + len;		/* Number of bytes loaded */

		switch (marker & 0xFF) {
		case 0xC0:	/* SOF0 (baseline JPEG) */
			if (len > JD_SZBUF) return JDR_MEM2;
			if (jd->infunc(jd, seg, len) != len) return JDR_INP;	/* Load segment data */

